In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
#Dataframe is collection of series sharing same index below example Apple, Blueberry etc are Indexes and CP, SP are Series(s)

In [6]:
df=pd.DataFrame(randn(6,4),['Apple','Blueberry','Mango','Cherry','Grapes','Strawberries'],['CP','SP','Profit','Tax'])

In [7]:
df

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Mango        -2.018168  0.740122  0.528813 -0.589001
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

In [8]:
# Recommendation is to use bracket notation to access column else it will be confusing to distinguish between the methods of 
# dataframe vs the columns

In [9]:
# a single series in the data frame

In [10]:
df['CP']

Apple           2.706850
Blueberry       0.651118
Mango          -2.018168
Cherry          0.188695
Grapes          0.190794
Strawberries    0.302665
Name: CP, dtype: float64

In [11]:
# to access multiple series pass list of series in the square bracket
#NOTE: Double bracket

In [12]:
df[['CP','Profit']]

                    CP    Profit
Apple         2.706850  0.907969
Blueberry     0.651118 -0.848077
Mango        -2.018168  0.528813
Cherry        0.188695 -0.933237
Grapes        0.190794  2.605967
Strawberries  0.302665 -1.706086

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
type(df['CP'])

pandas.core.series.Series

In [15]:
# Add new series(column) let us say Tax by using arithmatic function

In [16]:
df['Shipping']=df['CP']*.1

In [17]:
df

                    CP        SP    Profit       Tax  Shipping
Apple         2.706850  0.628133  0.907969  0.503826  0.270685
Blueberry     0.651118 -0.319318 -0.848077  0.605965  0.065112
Mango        -2.018168  0.740122  0.528813 -0.589001 -0.201817
Cherry        0.188695 -0.758872 -0.933237  0.955057  0.018870
Grapes        0.190794  1.978757  2.605967  0.683509  0.019079
Strawberries  0.302665  1.693723 -1.706086 -1.159119  0.030267

In [18]:
# Try deleting series(coumn) 
#It won't delete : Error is for Tax not found in Axis 0
#Axis 0 is basically index that is the Rows
#Uncomment below line to see error details

In [19]:
#df.drop('Shipping')

In [20]:
df.drop('Shipping',axis=1)

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Mango        -2.018168  0.740122  0.528813 -0.589001
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

In [21]:
df

                    CP        SP    Profit       Tax  Shipping
Apple         2.706850  0.628133  0.907969  0.503826  0.270685
Blueberry     0.651118 -0.319318 -0.848077  0.605965  0.065112
Mango        -2.018168  0.740122  0.528813 -0.589001 -0.201817
Cherry        0.188695 -0.758872 -0.933237  0.955057  0.018870
Grapes        0.190794  1.978757  2.605967  0.683509  0.019079
Strawberries  0.302665  1.693723 -1.706086 -1.159119  0.030267

In [22]:
# inpace Method should be set to true
#that makes sure that acidentally you do not temper with real data

In [23]:
df.drop('Shipping',axis=1,inplace=True)

In [24]:
df

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Mango        -2.018168  0.740122  0.528813 -0.589001
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

In [25]:
df.drop('Apple') # Axis -0 is by default

                    CP        SP    Profit       Tax
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Mango        -2.018168  0.740122  0.528813 -0.589001
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

# Selecting Rows

In [26]:
#loc -  stands for location; results is shown as series representation of column

In [27]:
df.loc['Mango']

CP       -2.018168
SP        0.740122
Profit    0.528813
Tax      -0.589001
Name: Mango, dtype: float64

In [28]:
# numerical based index

In [29]:
df.iloc[1]

CP        0.651118
SP       -0.319318
Profit   -0.848077
Tax       0.605965
Name: Blueberry, dtype: float64

In [30]:
#slecting by subset with row column combination

In [31]:
df.loc['Blueberry','CP']

0.6511179479432686

In [32]:
# Selecting specific indices with specific series(columns)

In [33]:
df.loc[['Mango','Blueberry'],['SP','Profit']]

                 SP    Profit
Mango      0.740122  0.528813
Blueberry -0.319318 -0.848077

# Conditional selection

In [34]:
# Conditional check will give us all based on boolean value returned on greater than 0 in dataframe

In [35]:
df>0

                 CP     SP  Profit    Tax
Apple          True   True    True   True
Blueberry      True  False   False   True
Mango         False   True    True  False
Cherry         True  False   False   True
Grapes         True   True    True   True
Strawberries   True   True   False  False

In [36]:
booldf=df>0 #Store that result into a variable

In [37]:
df[booldf]

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118       NaN       NaN  0.605965
Mango              NaN  0.740122  0.528813       NaN
Cherry        0.188695       NaN       NaN  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723       NaN       NaN

In [38]:
#below statement is same as above statement

In [39]:
df[df>0]

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118       NaN       NaN  0.605965
Mango              NaN  0.740122  0.528813       NaN
Cherry        0.188695       NaN       NaN  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723       NaN       NaN

In [40]:
# Conditional check for Column

In [41]:
boolCP=df['CP']>0

In [42]:
boolCP # get the values boolean resultant of Series

Apple            True
Blueberry        True
Mango           False
Cherry           True
Grapes           True
Strawberries     True
Name: CP, dtype: bool

# Filter out the dataframe values based on the conditional check in the column

In [43]:
df[boolCP]

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

In [44]:
# If boolean result of column is inquired from Dataframe it will return only those which pass that contition

In [45]:
df[df['SP']>0]

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Mango        -2.018168  0.740122  0.528813 -0.589001
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

In [46]:
# One more example

In [47]:
#Get only the Rows where tax is less than 0

In [48]:
resultdf=df[df['Tax']<0]

In [49]:
resultdf

                    CP        SP    Profit       Tax
Mango        -2.018168  0.740122  0.528813 -0.589001
Strawberries  0.302665  1.693723 -1.706086 -1.159119

# stacking up the commands

In [50]:
resultdf['CP']

Mango          -2.018168
Strawberries    0.302665
Name: CP, dtype: float64

In [51]:
# or same thing can be achieved by stacking up the commands such as

In [52]:
df[df['Tax']<0]['CP']

Mango          -2.018168
Strawberries    0.302665
Name: CP, dtype: float64

In [53]:
# or even multiple columns

In [54]:
df[df['Tax']<0][['CP','SP']]

                    CP        SP
Mango        -2.018168  0.740122
Strawberries  0.302665  1.693723

In [55]:
# Stacking up multiple conitions such as AND condition 
# DO NOT USE AND Operator OF PYTHON that is for single comparison like true true = true
# if you use AND it will throw ambiguous error
# But Use &(Ampersand) by pandas for series comparison 
# Same way for OR use | (Pipe)

In [56]:
df[(df['Tax']>0) & df['SP']>0]

                 CP        SP    Profit       Tax
Apple      2.706850  0.628133  0.907969  0.503826
Blueberry  0.651118 -0.319318 -0.848077  0.605965
Cherry     0.188695 -0.758872 -0.933237  0.955057
Grapes     0.190794  1.978757  2.605967  0.683509

In [57]:
df

                    CP        SP    Profit       Tax
Apple         2.706850  0.628133  0.907969  0.503826
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Mango        -2.018168  0.740122  0.528813 -0.589001
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119

In [58]:
# Resetting Index and setting index

In [59]:
#multi level indexing

In [60]:
#cross section accessing index instead of loc

In [61]:
strMonths='Apple Apple Samsung BB Window Motorola'

# # Group by function

In [62]:
print(list(strMonths.split()))

['Apple', 'Apple', 'Samsung', 'BB', 'Window', 'Motorola']

In [63]:
strPerson='DP Naga Suntu Kush Santa Shru'

In [64]:
strSales=[50,20000,1000,3000,500,150]

In [65]:
dataDict={'Company':list(strMonths.split()),'SalesPerson':list(strPerson.split()),'Sales':strSales}

In [66]:
df1=pd.DataFrame(dataDict)

In [67]:
df1

    Company SalesPerson  Sales
0     Apple          DP     50
1     Apple        Naga  20000
2   Samsung       Suntu   1000
3        BB        Kush   3000
4    Window       Santa    500
5  Motorola        Shru    150

In [68]:
gMonths=df1.groupby('Company')

# Aggregate functions on the dataframe

In [69]:
# MEAN

In [70]:
gMonths.mean()

          Sales
Company
Apple     10025
BB         3000
Motorola    150
Samsung    1000
Window      500

In [71]:
# Count

In [72]:
gMonths.count().transpose()

Company      Apple  BB  Motorola  Samsung  Window
SalesPerson      2   1         1        1       1
Sales            2   1         1        1       1

In [73]:
# Get a single index

In [74]:
gMonths.sum().loc['Apple']

Sales    20050
Name: Apple, dtype: int64

In [75]:
# MAX

In [76]:
gMonths.max()

         SalesPerson  Sales
Company
Apple           Naga  20000
BB              Kush   3000
Motorola        Shru    150
Samsung        Suntu   1000
Window         Santa    500

In [77]:
# Min

In [78]:
gMonths.min()

         SalesPerson  Sales
Company
Apple             DP     50
BB              Kush   3000
Motorola        Shru    150
Samsung        Suntu   1000
Window         Santa    500

In [79]:
# Describe gives basic formulae liek min, max,mean, std,count, Standard % ages of the numerical column(sales)

In [80]:
gMonths.describe()

         Sales                                                           \
         count     mean           std     min     25%      50%      75%
Company
Apple      2.0  10025.0  14106.780285    50.0  5037.5  10025.0  15012.5
BB         1.0   3000.0           NaN  3000.0  3000.0   3000.0   3000.0
Motorola   1.0    150.0           NaN   150.0   150.0    150.0    150.0
Samsung    1.0   1000.0           NaN  1000.0  1000.0   1000.0   1000.0
Window     1.0    500.0           NaN   500.0   500.0    500.0    500.0


              max
Company
Apple     20000.0
BB         3000.0
Motorola    150.0
Samsung    1000.0
Window      500.0

In [81]:
# Transpose the output such as  describe

In [82]:
gMonths.describe().transpose()

Company             Apple      BB  Motorola  Samsung  Window
Sales count      2.000000     1.0       1.0      1.0     1.0
      mean   10025.000000  3000.0     150.0   1000.0   500.0
      std    14106.780285     NaN       NaN      NaN     NaN
      min       50.000000  3000.0     150.0   1000.0   500.0
      25%     5037.500000  3000.0     150.0   1000.0   500.0
      50%    10025.000000  3000.0     150.0   1000.0   500.0
      75%    15012.500000  3000.0     150.0   1000.0   500.0
      max    20000.000000  3000.0     150.0   1000.0   500.0

In [83]:
df.head()

                 CP        SP    Profit       Tax
Apple      2.706850  0.628133  0.907969  0.503826
Blueberry  0.651118 -0.319318 -0.848077  0.605965
Mango     -2.018168  0.740122  0.528813 -0.589001
Cherry     0.188695 -0.758872 -0.933237  0.955057
Grapes     0.190794  1.978757  2.605967  0.683509

# # Other useful methods

In [84]:
# find unique elements

In [88]:
df1['Company'].unique()

5

In [ ]:
# find the length of unique items in the columns

In [ ]:
df1['Company'].nunique()

In [ ]:
# Count how many times a value appears

In [92]:
df1['Company'].value_counts()

Apple       2
Samsung     1
Window      1
BB          1
Motorola    1
Name: Company, dtype: int64

In [ ]:
# Use of lambda expression with

In [93]:
df1['Company'].apply(lambda x:x*3)

0             AppleAppleApple
1             AppleAppleApple
2       SamsungSamsungSamsung
3                      BBBBBB
4          WindowWindowWindow
5    MotorolaMotorolaMotorola
Name: Company, dtype: object

In [ ]:
# Get list of all the columns in dataframe

In [95]:
df.columns

Index(['CP', 'SP', 'Profit', 'Tax'], dtype='object')

In [ ]:
# Get the index

In [96]:
df.index

Index(['Apple', 'Blueberry', 'Mango', 'Cherry', 'Grapes', 'Strawberries'], dtype='object')

# Sorting and Ordering

In [97]:
df.sort_values('CP')

                    CP        SP    Profit       Tax
Mango        -2.018168  0.740122  0.528813 -0.589001
Cherry        0.188695 -0.758872 -0.933237  0.955057
Grapes        0.190794  1.978757  2.605967  0.683509
Strawberries  0.302665  1.693723 -1.706086 -1.159119
Blueberry     0.651118 -0.319318 -0.848077  0.605965
Apple         2.706850  0.628133  0.907969  0.503826